## Data Wrangling: Clean, Transform, Merge, Reshape

In [2]:
from __future__ import division
from numpy.random import randn
import numpy as np
import os
import matplotlib.pyplot as plt
np.random.seed(12345)
plt.rc('figure', figsize=(10, 6))
from pandas import Series, DataFrame
import pandas
import pandas as pd
np.set_printoptions(precision=4, threshold=500)
pd.options.display.max_rows = 100

In [3]:
%matplotlib inline

In [4]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

## Combining and merging data sets

### Database-style DataFrame merges

In [5]:
df1 = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                 'data1': range(7)})
df2 = DataFrame({'key': ['a', 'b', 'd'],
                 'data2': range(3)})
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [6]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [7]:
pd.merge(df1, df2)

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [8]:
pd.merge(df1, df2, on='key')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [9]:
df3 = DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                 'data1': range(7)})
df4 = DataFrame({'rkey': ['a', 'b', 'd'],
                 'data2': range(3)})
df3
df4

   data1 lkey
0      0    b
1      1    b
2      2    a
3      3    c
4      4    a
5      5    a
6      6    b

   data2 rkey
0      0    a
1      1    b
2      2    d

In [10]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

   data1 lkey  data2 rkey
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      4    a      0    a
5      5    a      0    a

In [11]:
df1
df2
pd.merge(df1, df2, how='outer')

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

   data2 key
0      0   a
1      1   b
2      2   d

   data1 key  data2
0    0.0   b    1.0
1    1.0   b    1.0
2    6.0   b    1.0
3    2.0   a    0.0
4    4.0   a    0.0
5    5.0   a    0.0
6    3.0   c    NaN
7    NaN   d    2.0

In [12]:
df1 = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                 'data1': range(6)})
df2 = DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],
                 'data2': range(5)})
df1
df2

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

   data2 key
0      0   a
1      1   b
2      2   a
3      3   b
4      4   d

In [13]:
pd.merge(df1, df2, on='key', how='left')

    data1 key  data2
0       0   b    1.0
1       0   b    3.0
2       1   b    1.0
3       1   b    3.0
4       2   a    0.0
5       2   a    2.0
6       3   c    NaN
7       4   a    0.0
8       4   a    2.0
9       5   b    1.0
10      5   b    3.0

In [14]:
pd.merge(df1, df2, how='inner')

   data1 key  data2
0      0   b      1
1      0   b      3
2      1   b      1
3      1   b      3
4      5   b      1
5      5   b      3
6      2   a      0
7      2   a      2
8      4   a      0
9      4   a      2

In [15]:
left = DataFrame({'key1': ['foo', 'foo', 'bar'],
                  'key2': ['one', 'two', 'one'],
                  'lval': [1, 2, 3]})
right = DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                   'key2': ['one', 'one', 'one', 'two'],
                   'rval': [4, 5, 6, 7]})
left
right
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [16]:
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [17]:
pd.merge(left, right, on='key1', suffixes=('_left', '_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

### Merging on index

In [18]:
left1 = DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
                  'value': range(6)})
right1 = DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])
left1
right1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

   group_val
a        3.5
b        7.0

In [19]:
pd.merge(left1, right1, left_on='key', right_index=True)
pd.merge(right1, left1, right_on='key', left_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

   group_val key  value
0        3.5   a      0
2        3.5   a      2
3        3.5   a      3
1        7.0   b      1
4        7.0   b      4

In [20]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [21]:
lefth = DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
                   'key2': [2000, 2001, 2002, 2001, 2002],
                   'data': np.arange(5.)})
righth = DataFrame(np.arange(12).reshape((6, 2)),
                   index=[['Nevada', 'Nevada', 'Ohio', 'Ohio', 'Ohio', 'Ohio'],
                          [2001, 2000, 2000, 2000, 2001, 2002]],
                   columns=['event1', 'event2'])
lefth
righth

   data    key1  key2
0   0.0    Ohio  2000
1   1.0    Ohio  2001
2   2.0    Ohio  2002
3   3.0  Nevada  2001
4   4.0  Nevada  2002

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [22]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True)

   data    key1  key2  event1  event2
0   0.0    Ohio  2000       4       5
0   0.0    Ohio  2000       6       7
1   1.0    Ohio  2001       8       9
2   2.0    Ohio  2002      10      11
3   3.0  Nevada  2001       0       1

In [23]:
pd.merge(lefth, righth, left_on=['key1', 'key2'],
         right_index=True, how='outer')

   data    key1  key2  event1  event2
0   0.0    Ohio  2000     4.0     5.0
0   0.0    Ohio  2000     6.0     7.0
1   1.0    Ohio  2001     8.0     9.0
2   2.0    Ohio  2002    10.0    11.0
3   3.0  Nevada  2001     0.0     1.0
4   4.0  Nevada  2002     NaN     NaN
4   NaN  Nevada  2000     2.0     3.0

In [24]:
left2 = DataFrame([[1., 2.], [3., 4.], [5., 6.]], index=['a', 'c', 'e'],
                 columns=['Ohio', 'Nevada'])
right2 = DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
                   index=['b', 'c', 'd', 'e'], columns=['Missouri', 'Alabama'])
left2
right2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [25]:
pd.merge(left2, right2, how='outer', left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [26]:
left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [27]:
left1
right1
left1.join(right1, on='key')

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

   group_val
a        3.5
b        7.0

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [28]:
left2
right2
another = DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]],
                    index=['a', 'c', 'e', 'f'], columns=['New York', 'Oregon'])
another

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [29]:
left2.join([right2, another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0

In [30]:
left2.join([right2, another], how='outer')

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
b   NaN     NaN       7.0      8.0       NaN     NaN
c   3.0     4.0       9.0     10.0       9.0    10.0
d   NaN     NaN      11.0     12.0       NaN     NaN
e   5.0     6.0      13.0     14.0      11.0    12.0
f   NaN     NaN       NaN      NaN      16.0    17.0

In [31]:
left2
right2
another = DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]],
                    index=['a', 'c', 'e', 'f'], columns=['New York', 'Ohio'])
another

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

   New York  Ohio
a       7.0   8.0
c       9.0  10.0
e      11.0  12.0
f      16.0  17.0

In [32]:
left2.join([right2, another])

ValueError: Indexes have overlapping values: ['Ohio']

### Concatenating along an axis

In [33]:
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [34]:
np.concatenate([arr, arr], axis=1)
np.concatenate([arr, arr])

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [35]:
s1 = Series([0, 1], index=['a', 'b'])
s2 = Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = Series([5, 6], index=['f', 'g'])
s1
s2
s3

a    0
b    1
dtype: int64

c    2
d    3
e    4
dtype: int64

f    5
g    6
dtype: int64

In [36]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [37]:
pd.concat([s1, s2, s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [38]:
s4 = pd.concat([s1 * 5, s3])
s4

a    0
b    5
f    5
g    6
dtype: int64

In [39]:
pd.concat([s1, s4], axis=1)

     0  1
a  0.0  0
b  1.0  5
f  NaN  5
g  NaN  6

In [40]:
pd.concat([s1, s4], axis=1, join='inner')

   0  1
a  0  0
b  1  5

In [41]:
s1
s4
pd.concat([s1, s4], axis=1, join_axes=[['a', 'c', 'b', 'e', 'wow']])

a    0
b    1
dtype: int64

a    0
b    5
f    5
g    6
dtype: int64

       0    1
a    0.0  0.0
c    NaN  NaN
b    1.0  5.0
e    NaN  NaN
wow  NaN  NaN

In [53]:
result = pd.concat([s1, s2, s3], keys=['one', 'two', 'three'])
            # concat의 keys   를 주게 되면

In [56]:
result # 계층 색인이 됨.

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: int64

In [58]:
# Much more on the unstack function later
result.unstack()  # 아래서 위로 올림  - 데이터 프레임으로 나오게 됨.

         a    b    c    d    e    f    g
one    0.0  1.0  NaN  NaN  NaN  NaN  NaN
two    NaN  NaN  2.0  3.0  4.0  NaN  NaN
three  NaN  NaN  NaN  NaN  NaN  5.0  6.0

In [59]:
pd.concat([s1, s2, s3], axis=1, keys=['one', 'two', 'three'])
        # 시리즈 형태

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [61]:
df1 = DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
                columns=['one', 'two'])
df2 = DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'],
                columns=['three', 'four'])
df1
df2      # 데이터 프레임을 리스트에 넣어서 이어 붙임!
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'])

   one  two
a    0    1
b    2    3
c    4    5

   three  four
a      5     6
c      7     8

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [71]:
pd.concat([df1,df2])
pd.concat([df1,df2], ignore_index=True)       # 인덱스 무시하고 무조건 정수 인덱스가 나옴   -  0부터 ~~~

          a         b         c         d
0  1.669025 -0.438570 -0.539741  0.476985
1  3.248944 -1.021228 -0.577087  0.124121
2  0.302614  0.523772  0.000940  1.343810
0 -2.370232 -0.713544       NaN -0.831154
1  0.560145 -1.860761       NaN -0.860757

          a         b         c         d
0  1.669025 -0.438570 -0.539741  0.476985
1  3.248944 -1.021228 -0.577087  0.124121
2  0.302614  0.523772  0.000940  1.343810
3 -2.370232 -0.713544       NaN -0.831154
4  0.560145 -1.860761       NaN -0.860757

In [62]:
pd.concat({'level1': df1, 'level2': df2}, axis=1)
             # 사전으로 값을 줌.o

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [64]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'],
          names=['upper', 'lower'])   # 컬럼 레벨 별로 이름을 주겠다.

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [66]:
df1 = DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df2 = DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])
df1
df2

          a         b         c         d
0  1.669025 -0.438570 -0.539741  0.476985
1  3.248944 -1.021228 -0.577087  0.124121
2  0.302614  0.523772  0.000940  1.343810

          b         d         a
0 -0.713544 -0.831154 -2.370232
1 -1.860761 -0.860757  0.560145

In [67]:
pd.concat([df1, df2])    # axis = 0 자동 /   로우 단위로 붙였는데, 
# 0,1,2,3 순서대로 보고 싶다.

          a         b         c         d
0  1.669025 -0.438570 -0.539741  0.476985
1  3.248944 -1.021228 -0.577087  0.124121
2  0.302614  0.523772  0.000940  1.343810
0 -2.370232 -0.713544       NaN -0.831154
1  0.560145 -1.860761       NaN -0.860757

In [68]:
pd.concat([df1, df2], ignore_index=True)   # 기존 것 무시하고, 새롭게 인덱스를 표시해줌.

          a         b         c         d
0  1.669025 -0.438570 -0.539741  0.476985
1  3.248944 -1.021228 -0.577087  0.124121
2  0.302614  0.523772  0.000940  1.343810
3 -2.370232 -0.713544       NaN -0.831154
4  0.560145 -1.860761       NaN -0.860757

### Combining data with overlap

In [72]:
a = Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],
           index=['f', 'e', 'd', 'c', 'b', 'a'])
b = Series(np.arange(len(a), dtype=np.float64),
           index=['f', 'e', 'd', 'c', 'b', 'a'])
b[-1] = np.nan  # b 시리즈의 마지막 값(-1)을 null 값으로 바꾸겠다.
a
b

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [79]:
# 시리즈 = merge 안됨.

np.where(pd.isnull(a), b, a)
           # 이 값이 트루이면  b를 리턴 / 아니면 a 리턴

array([0. , 2.5, 2. , 3.5, 4.5, nan])

In [77]:
b[:-2].combine_first(a[2:])
# b - f e d c 값을 대상으로 combine   => b값이 없음. 한쪽만 null 이므로 다른 값이 나옴.
# a - f e d c 값 
# f는 제로가 나옴

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [81]:
df1 = DataFrame({'a': [1., np.nan, 5., np.nan],
                 'b': [np.nan, 2., np.nan, 6.],
                 'c': range(2, 18, 4)})

df2 = DataFrame({'a': [5., 4., np.nan, 3., 7.],
                 'b': [np.nan, 3., 4., 6., 8.]})
df1
df2
df1.combine_first(df2)

# 우선순위는 df1 이 우선이고, df1 값이 null 이면 df2 값이 도출됨.

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

## Reshaping and pivoting

### Reshaping with hierarchical indexing

In [82]:
data = DataFrame(np.arange(6).reshape((2, 3)),
                 index=pd.Index(['Ohio', 'Colorado'], name='state'),
                 columns=pd.Index(['one', 'two', 'three'], name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [83]:
result = data.stack()
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [84]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [86]:
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [87]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [88]:
s1 = Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = Series([4, 5, 6], index=['c', 'd', 'e'])
s1
s2
data2 = pd.concat([s1, s2], keys=['one', 'two'])
data2

a    0
b    1
c    2
d    3
dtype: int64

c    4
d    5
e    6
dtype: int64

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [89]:
data2.unstack() # 아래서 위로 올려버림 (a, b,c , d 를 위로 )
data2.unstack(0)

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

   one  two
a  0.0  NaN
b  1.0  NaN
c  2.0  4.0
d  3.0  5.0
e  NaN  6.0

In [90]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [91]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [92]:
result
df = DataFrame({'left': result, 'right': result + 5},
               columns=pd.Index(['left', 'right'], name='side'))
df

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [93]:
df.unstack('state')  # state 가 칼럼으로 가고, number가 로우 인덱스로 남게됨.

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [96]:
df.unstack('state').stack('side')   # 위로 보낼 것, 아래로 보낼 것을 정하면 됨.

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

### Pivoting "long" to "wide" format

In [97]:
Pivoting

NameError: name 'Pivoting' is not defined

In [98]:
data = pd.read_csv('ch07/macrodata.csv')
data

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.980,139.7,2.82,5.8,177.146,0.00,0.00
1,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.150,141.7,3.08,5.1,177.830,2.34,0.74
2,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.350,140.5,3.82,5.3,178.657,2.74,1.09
3,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.370,140.0,4.33,5.6,179.386,0.27,4.06
4,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.540,139.6,3.50,5.2,180.007,2.31,1.19
5,1960.0,2.0,2834.390,1792.9,298.152,460.400,1966.1,29.550,140.2,2.68,5.2,180.671,0.14,2.55
6,1960.0,3.0,2839.022,1785.8,296.375,474.676,1967.8,29.750,140.9,2.36,5.6,181.528,2.70,-0.34
7,1960.0,4.0,2802.616,1788.2,259.764,476.434,1966.6,29.840,141.1,2.29,6.3,182.287,1.21,1.08
8,1961.0,1.0,2819.264,1787.7,266.405,475.854,1984.5,29.810,142.1,2.37,6.8,182.992,-0.40,2.77
9,1961.0,2.0,2872.005,1814.3,286.246,480.328,2014.4,29.920,142.9,2.29,7.0,183.691,1.47,0.81
10,1961.0,3.0,2918.419,1823.1,310.227,493.828,2041.9,29.980,144.1,2.32,6.8,184.524,0.80,1.52
11,1961.0,4.0,2977.830,1859.6,315.463,502.521,2082.0,30.040,145.2,2.60,6.2,185.242,0.80,1.80
12,1962.0,1.0,3031.241,1879.4,334.271,520.960,2101.7,30.210,146.4,2.73,5.6,185.874,2.26,0.47
13,1962.0,2.0,3064.709,1902.5,331.039,523.066,2125.2,30.220,146.5,2.78,5.5,186.538,0.13,2.65
14,1962.0,3.0,3093.047,1917.9,336.962,538.838,2137.0,30.380,146.7,2.78,5.6,187.323,2.11,0.67
15,1962.0,4.0,3100.563,1945.1,325.650,535.912,2154.6,30.440,148.3,2.87,5.5,188.013,0.79,2.08
16,1963.0,1.0,3141.087,1958.2,343.721,522.917,2172.5,30.480,149.7,2.90,5.8,188.580,0.53,2.38
17,1963.0,2.0,3180.447,1976.9,348.730,518.108,2193.1,30.690,151.3,3.03,5.7,189.242,2.75,0.29
18,1963.0,3.0,3240.332,2003.8,360.102,546.893,2217.9,30.750,152.6,3.38,5.5,190.028,0.78,2.60
19,1963.0,4.0,3264.967,2020.6,364.534,532.383,2254.6,30.940,153.7,3.52,5.6,190.668,2.46,1.06
20,1964.0,1.0,3338.246,2060.5,379.523,529.686,2299.6,30.950,154.8,3.51,5.5,191.245,0.13,3.38
21,1964.0,2.0,3376.587,2096.7,377.778,526.175,2362.1,31.020,156.8,3.47,5.2,191.889,0.90,2.57
22,1964.0,3.0,3422.469,2135.2,386.754,522.008,2392.7,31.120,159.2,3.53,5.0,192.631,1.29,2.25
23,1964.0,4.0,3431.957,2141.2,389.910,514.603,2420.4,31.280,160.7,3.76,5.0,193.223,2.05,1.71
24,1965.0,1.0,3516.251,2188.8,429.145,508.006,2447.4,31.380,162.0,3.93,4.9,193.709,1.28,2.65
25,1965.0,2.0,3563.960,2213.0,429.119,508.931,2474.5,31.580,163.1,3.84,4.7,194.303,2.54,1.30
26,1965.0,3.0,3636.285,2251.0,444.444,529.446,2542.6,31.650,166.0,3.93,4.4,194.997,0.89,3.04
27,1965.0,4.0,3724.014,2314.3,446.493,544.121,2594.1,31.880,169.1,4.35,4.1,195.539,2.90,1.46
28,1966.0,1.0,3815.423,2348.5,484.244,556.593,2618.4,32.280,171.8,4.62,3.9,195.999,4.99,-0.37
29,1966.0,2.0,3828.124,2354.5,475.408,571.371,2624.7,32.450,170.3,4.65,3.8,196.560,2.10,2.55
30,1966.0,3.0,3853.301,2381.5,470.697,594.514,2657.8,32.850,171.2,5.23,3.8,197.207,4.90,0.33
31,1966.0,4.0,3884.520,2391.4,472.957,599.528,2688.2,32.900,171.9,5.00,3.7,197.736,0.61,4.39
32,1967.0,1.0,3918.740,2405.3,460.007,640.682,2728.4,33.100,174.2,4.22,3.8,198.206,2.42,1.80
33,1967.0,2.0,3919.556,2438.1,440.393,631.430,2750.8,33.400,178.1,3.78,3.8,198.712,3.61,0.17
34,1967.0,3.0,3950.826,2450.6,453.033,641.504,2777.1,33.700,181.6,4.42,3.8,199.311,3.58,0.84
35,1967.0,4.0,3980.970,2465.7,462.834,640.234,2797.4,34.100,184.3,4.90,3.9,199.808,4.72,0.18
36,1968.0,1.0,4063.013,2524.6,472.907,651.378,2846.2,34.400,186.6,5.18,3.7,200.208,3.50,1.67
37,1968.0,2.0,4131.998,2563.3,492.026,646.145,2893.5,34.900,190.5,5.50,3.5,200.706,5.77,-0.28
38,1968.0,3.0,4160.267,2611.5,476.053,640.615,2899.3,35.300,194.0,5.21,3.5,201.290,4.56,0.65
39,1968.0,4.0,4178.293,2623.5,480.998,636.729,2918.4,35.700,198.7,5.85,3.4,201.760,4.51,1.34
40,1969.0,1.0,4244.100,2652.9,512.686,633.224,2923.4,36.300,200.7,6.08,3.4,202.161,6.67,-0.58
41,1969.0,2.0,4256.460,2669.8,508.601,623.160,2952.9,36.800,201.7,6.49,3.4,202.677,5.47,1.02
42,1969.0,3.0,4283.378,2682.7,520.360,623.613,3012.9,37.300,202.9,7.02,3.6,203.302,5.40,1.63
43,1969.0,4.0,4263.261,2704.1,492.334,606.900,3034.9,37.900,206.2,7.64,3.6,203.849,6.38,1.26
44,1970.0,1.0,4256.573,2720.7,476.925,594.888,3050.1,38.500,206.7,6.76,4.2,204.401,6.28,0.47
45,1970.0,2.0,4264.289,2733.2,478.419,576.257,3103.5,38.900,208.0,6.66,4.8,205.052,4.13,2.52
46,1970.0,3.0,4302.259,2757.1,486.594,567.743,3145.4,39.400,212.9,6.15,5.2,205.788,5.11,1.04
47,1970.0,4.0,4256.637,2749.6,458.406,564.666,3135.1,39.900,215.5,4.86,5.8,206.466,5.04,-0.18
48,1971.0,1.0,4374.016,2802.2,517.935,542.709,3197.3,40.100,220.0,3.65,5.9,207.065,2.00,1.65
49,1971.0,2.0,4398.829,2827.9,533.986,534.905,3245.3,40.600,224.9,4.76,5.9,207.661,4.96,-0.19
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
153,1997.0,2.0,9809.551,6456.2,1543.976,693.525,7061.5,160.400,1066.2,5.01,5.0,272.912,1.25,3.76
154,1997.0,3.0,9932.672,6566.0,1571.426,691.261,7142.4,161.500,1065.5,5.02,4.9,273.852,2.73,2.29
155,1997.0,4.0,10008.874,6641.1,1596.523,690.311,7241.5,162.000,1074.4,5.11,4.7,274.626,1.24,3.88
156,1998.0,1.0,10103.425,6707.2,1672.732,668.783,7406.2,162.200,1076.1,5.02,4.6,275.304,0.49,4.53
157,1998.0,2.0,10194.277,6822.6,1652.716,687.184,7512.0,163.200,1075.0,4.98,4.4,276.115,2.46,2.52
158,1998.0,3.0,10328.787,6913.1,1700.071,681.472,7591.0,163.900,1086.0,4.49,4.5,277.003,1.71,2.78
159,1998.0,4.0,10507.575,7019.1,1754.743,688.147,7646.5,164.700,1097.8,4.38,4.4,277.790,1.95,2.43
160,1999.0,1.0,10601.179,7088.3,1809.993,683.601,7698.4,165.900,1101.9,4.39,4.3,278.451,2.90,1.49
161,1999.0,2.0,10684.049,7199.9,1803.674,683.594,7716.0,166.700,1098.7,4.54,4.3,279.295,1.92,2.62
162,1999.0,3.0,10819.914,7286.4,1848.949,697.936,7765.9,168.100,1102.3,4.75,4.2,280.203,3.35,1.41
163,1999.0,4.0,11014.254,7389.2,1914.567,713.445,7887.7,169.300,1121.9,5.20,4.1,280.976,2.85,2.35
164,2000.0,1.0,11043.044,7501.3,1887.836,685.216,8053.4,170.900,1113.5,5.63,4.0,281.653,3.76,1.87
165,2000.0,2.0,11258.454,7571.8,2018.529,712.641,8135.9,172.700,1103.0,5.81,3.9,282.385,4.19,1.62
166,2000.0,3.0,11267.867,7645.9,1986.956,698.827,8222.3,173.900,1098.7,6.07,4.0,283.190,2.77,3.30
167,2000.0,4.0,11334.544,7713.5,1987.845,695.597,8234.6,175.600,1097.7,5.70,3.9,283.900,3.89,1.81
168,2001.0,1.0,11297.171,7744.3,1882.691,710.403,8296.5,176.400,1114.9,4.39,4.2,284.550,1.82,2.57
169,2001.0,2.0,11371.251,7773.5,1876.650,725.623,8273.7,177.400,1139.7,3.54,4.4,285.267,2.26,1.28
170,2001.0,3.0,11340.075,7807.7,1837.074,730.493,8484.5,177.600,1166.0,2.72,4.8,286.047,0.45,2.27
171,2001.0,4.0,11380.128,7930.0,1731.189,739.318,8385.5,177.700,1190.9,1.74,5.5,286.728,0.23,1.51
172,2002.0,1.0,11477.868,7957.3,1789.327,756.915,8611.6,179.300,1185.9,1.75,5.7,287.328,3.59,-1.84
173,2002.0,2.0,11538.770,7997.8,1810.779,774.408,8658.9,180.000,1199.5,1.70,5.8,288.028,1.56,0.14
174,2002.0,3.0,11596.430,8052.0,1814.531,786.673,8629.2,181.200,1204.0,1.61,5.7,288.783,2.66,-1.05
175,2002.0,4.0,11598.824,8080.6,1813.219,799.967,8649.6,182.600,1226.8,1.20,5.8,289.421,3.08,-1.88
176,2003.0,1.0,11645.819,8122.3,1813.141,800.196,8681.3,183.200,1248.4,1.14,5.9,290.019,1.31,-0.17
177,2003.0,2.0,11738.706,8197.8,1823.698,838.775,8812.5,183.700,1287.9,0.96,6.2,290.704,1.09,-0.13
178,2003.0,3.0,11935.461,8312.1,1889.883,839.598,8935.4,184.900,1297.3,0.94,6.1,291.449,2.60,-1.67
179,2003.0,4.0,12042.817,8358.0,1959.783,845.722,8986.4,186.300,1306.1,0.90,5.8,292.057,3.02,-2.11
180,2004.0,1.0,12127.623,8437.6,1970.015,856.570,9025.9,187.400,1332.1,0.94,5.7,292.635,2.35,-1.42
181,2004.0,2.0,12213.818,8483.2,2055.580,861.440,9115.0,189.100,1340.5,1.21,5.6,293.310,3.61,-2.41
182,2004.0,3.0,12303.533,8555.8,2082.231,876.385,9175.9,190.800,1361.0,1.63,5.4,294.066,3.58,-1.95
183,2004.0,4.0,12410.282,8654.2,2125.152,865.596,9303.4,191.800,1366.6,2.20,5.4,294.741,2.09,0.11
184,2005.0,1.0,12534.113,8719.0,2170.299,869.204,9189.6,193.800,1357.8,2.69,5.3,295.308,4.15,-1.46
185,2005.0,2.0,12587.535,8802.9,2131.468,870.044,9253.0,194.700,1366.6,3.01,5.1,295.994,1.85,1.16
186,2005.0,3.0,12683.153,8865.6,2154.949,890.394,9308.0,199.200,1375.0,3.52,5.0,296.770,9.14,-5.62
187,2005.0,4.0,12748.699,8888.5,2232.193,875.557,9358.7,199.400,1380.6,4.00,4.9,297.435,0.40,3.60
188,2006.0,1.0,12915.938,8986.6,2264.721,900.511,9533.8,200.700,1380.5,4.51,4.7,298.061,2.60,1.91
189,2006.0,2.0,12962.462,9035.0,2261.247,892.839,9617.3,202.700,1369.2,4.82,4.7,298.766,3.97,0.85
190,2006.0,3.0,12965.916,9090.7,2229.636,892.002,9662.5,201.900,1369.4,4.90,4.7,299.593,-1.58,6.48
191,2006.0,4.0,13060.679,9181.6,2165.966,894.404,9788.8,203.574,1373.6,4.92,4.4,300.320,3.30,1.62
192,2007.0,1.0,13099.901,9265.1,2132.609,882.766,9830.2,205.920,1379.7,4.95,4.5,300.977,4.58,0.36
193,2007.0,2.0,13203.977,9291.5,2162.214,898.713,9842.7,207.338,1370.0,4.72,4.5,301.714,2.75,1.97
194,2007.0,3.0,13321.109,9335.6,2166.491,918.983,9883.9,209.133,1379.2,4.00,4.7,302.509,3.45,0.55
195,2007.0,4.0,13391.249,9363.6,2123.426,925.110,9886.2,212.495,1377.4,3.01,4.8,303.204,6.38,-3.37
196,2008.0,1.0,13366.865,9349.6,2082.886,943.372,9826.8,213.997,1384.0,1.56,4.9,303.803,2.82,-1.26
197,2008.0,2.0,13415.266,9351.0,2026.518,961.280,10059.0,218.610,1409.3,1.74,5.4,304.483,8.53,-6.79
198,2008.0,3.0,13324.600,9267.7,1990.693,991.551,9838.3,216.889,1474.7,1.17,6.0,305.270,-3.16,4.33
199,2008.0,4.0,13141.920,9195.3,1857.661,1007.273,9920.4,212.174,1576.5,0.12,6.9,305.952,-8.79,8.91
200,2009.0,1.0,12925.410,9209.2,1558.494,996.287,9926.4,212.671,1592.8,0.22,8.1,306.547,0.94,-0.71
201,2009.0,2.0,12901.504,9189.0,1456.678,1023.528,10077.5,214.469,1653.6,0.18,9.2,307.226,3.37,-3.19
202,2009.0,3.0,12990.341,9256.0,1486.398,1044.088,10040.6,216.385,1673.9,0.12,9.6,308.013,3.56,-3.44

In [100]:
periods = pd.PeriodIndex(year=data.year, quarter=data.quarter, name='date')
periods                       # data의 year 항목을 year로 
               # 시계열 데이터를 위한 인덱스

PeriodIndex(['1959Q1', '1959Q2', '1959Q3', '1959Q4', '1960Q1', '1960Q2',
             '1960Q3', '1960Q4', '1961Q1', '1961Q2',
             ...
             '2007Q2', '2007Q3', '2007Q4', '2008Q1', '2008Q2', '2008Q3',
             '2008Q4', '2009Q1', '2009Q2', '2009Q3'],
            dtype='period[Q-DEC]', name='date', length=203, freq='Q-DEC')

In [101]:
data.to_records()      # 원래 데이터는 dataframe 인데, 튜플의 리스트로 담고 있는 형태로 바꿔줌.

rec.array([(  0, 1959., 1.,  2710.349, 1707.4,  286.898,  470.045,  1886.9,  28.98 ,  139.7,  2.82,  5.8, 177.146,  0.  ,  0.  ),
           (  1, 1959., 2.,  2778.801, 1733.7,  310.859,  481.301,  1919.7,  29.15 ,  141.7,  3.08,  5.1, 177.83 ,  2.34,  0.74),
           (  2, 1959., 3.,  2775.488, 1751.8,  289.226,  491.26 ,  1916.4,  29.35 ,  140.5,  3.82,  5.3, 178.657,  2.74,  1.09),
           (  3, 1959., 4.,  2785.204, 1753.7,  299.356,  484.052,  1931.3,  29.37 ,  140. ,  4.33,  5.6, 179.386,  0.27,  4.06),
           (  4, 1960., 1.,  2847.699, 1770.5,  331.722,  462.199,  1955.5,  29.54 ,  139.6,  3.5 ,  5.2, 180.007,  2.31,  1.19),
           (  5, 1960., 2.,  2834.39 , 1792.9,  298.152,  460.4  ,  1966.1,  29.55 ,  140.2,  2.68,  5.2, 180.671,  0.14,  2.55),
           (  6, 1960., 3.,  2839.022, 1785.8,  296.375,  474.676,  1967.8,  29.75 ,  140.9,  2.36,  5.6, 181.528,  2.7 , -0.34),
           (  7, 1960., 4.,  2802.616, 1788.2,  259.764,  476.434,  1966.6,  29.84 ,  141.1,  2.29,  6.3, 182.287,  1.21,  1.08),
           (  8, 1961., 1.,  2819.264, 1787.7,  266.405,  475.854,  1984.5,  29.81 ,  142.1,  2.37,  6.8, 182.992, -0.4 ,  2.77),
           (  9, 1961., 2.,  2872.005, 1814.3,  286.246,  480.328,  2014.4,  29.92 ,  142.9,  2.29,  7. , 183.691,  1.47,  0.81),
           ( 10, 1961., 3.,  2918.419, 1823.1,  310.227,  493.828,  2041.9,  29.98 ,  144.1,  2.32,  6.8, 184.524,  0.8 ,  1.52),
           ( 11, 1961., 4.,  2977.83 , 1859.6,  315.463,  502.521,  2082. ,  30.04 ,  145.2,  2.6 ,  6.2, 185.242,  0.8 ,  1.8 ),
           ( 12, 1962., 1.,  3031.241, 1879.4,  334.271,  520.96 ,  2101.7,  30.21 ,  146.4,  2.73,  5.6, 185.874,  2.26,  0.47),
           ( 13, 1962., 2.,  3064.709, 1902.5,  331.039,  523.066,  2125.2,  30.22 ,  146.5,  2.78,  5.5, 186.538,  0.13,  2.65),
           ( 14, 1962., 3.,  3093.047, 1917.9,  336.962,  538.838,  2137. ,  30.38 ,  146.7,  2.78,  5.6, 187.323,  2.11,  0.67),
           ( 15, 1962., 4.,  3100.563, 1945.1,  325.65 ,  535.912,  2154.6,  30.44 ,  148.3,  2.87,  5.5, 188.013,  0.79,  2.08),
           ( 16, 1963., 1.,  3141.087, 1958.2,  343.721,  522.917,  2172.5,  30.48 ,  149.7,  2.9 ,  5.8, 188.58 ,  0.53,  2.38),
           ( 17, 1963., 2.,  3180.447, 1976.9,  348.73 ,  518.108,  2193.1,  30.69 ,  151.3,  3.03,  5.7, 189.242,  2.75,  0.29),
           ( 18, 1963., 3.,  3240.332, 2003.8,  360.102,  546.893,  2217.9,  30.75 ,  152.6,  3.38,  5.5, 190.028,  0.78,  2.6 ),
           ( 19, 1963., 4.,  3264.967, 2020.6,  364.534,  532.383,  2254.6,  30.94 ,  153.7,  3.52,  5.6, 190.668,  2.46,  1.06),
           ( 20, 1964., 1.,  3338.246, 2060.5,  379.523,  529.686,  2299.6,  30.95 ,  154.8,  3.51,  5.5, 191.245,  0.13,  3.38),
           ( 21, 1964., 2.,  3376.587, 2096.7,  377.778,  526.175,  2362.1,  31.02 ,  156.8,  3.47,  5.2, 191.889,  0.9 ,  2.57),
           ( 22, 1964., 3.,  3422.469, 2135.2,  386.754,  522.008,  2392.7,  31.12 ,  159.2,  3.53,  5. , 192.631,  1.29,  2.25),
           ( 23, 1964., 4.,  3431.957, 2141.2,  389.91 ,  514.603,  2420.4,  31.28 ,  160.7,  3.76,  5. , 193.223,  2.05,  1.71),
           ( 24, 1965., 1.,  3516.251, 2188.8,  429.145,  508.006,  2447.4,  31.38 ,  162. ,  3.93,  4.9, 193.709,  1.28,  2.65),
           ( 25, 1965., 2.,  3563.96 , 2213. ,  429.119,  508.931,  2474.5,  31.58 ,  163.1,  3.84,  4.7, 194.303,  2.54,  1.3 ),
           ( 26, 1965., 3.,  3636.285, 2251. ,  444.444,  529.446,  2542.6,  31.65 ,  166. ,  3.93,  4.4, 194.997,  0.89,  3.04),
           ( 27, 1965., 4.,  3724.014, 2314.3,  446.493,  544.121,  2594.1,  31.88 ,  169.1,  4.35,  4.1, 195.539,  2.9 ,  1.46),
           ( 28, 1966., 1.,  3815.423, 2348.5,  484.244,  556.593,  2618.4,  32.28 ,  171.8,  4.62,  3.9, 195.999,  4.99, -0.37),
           ( 29, 1966., 2.,  3828.124, 2354.5,  475.408,  571.371,  2624.7,  32.45 ,  170.3,  4.65,  3.8, 196.56 ,  2.1 ,  2.55),
           ( 30, 1966., 3.,  3853.301, 2381.5,  470.697,  594.514,  2657.8,  32.85 ,  171.2,  5.23,  3.8, 197.207,  4.9 ,  0.33),
           ( 31, 1966., 4.,  3884.52 , 2391.4,  472.957,  599.528,  2688.2,  32.9  ,  171.9,  5.  ,  3.7, 197.736,  0.61,  4.39),
           ( 32, 1967., 1.,  3918.74 , 2405.3,  460.007,  640.682,  2728.4,  33.1  ,  174.2,  4.22,  3.8, 198.206,  2.42,  1.8 ),
           ( 33, 1967., 2.,  3919.556, 2438.1,  440.393,  631.43 ,  2750.8,  33.4  ,  178.1,  3.78,  3.8, 198.712,  3.61,  0.17),
           ( 34, 1967., 3.,  3950.826, 2450.6,  453.033,  641.504,  2777.1,  33.7  ,  181.6,  4.42,  3.8, 199.311,  3.58,  0.84),
           ( 35, 1967., 4.,  3980.97 , 2465.7,  462.834,  640.234,  2797.4,  34.1  ,  184.3,  4.9 ,  3.9, 199.808,  4.72,  0.18),
           ( 36, 1968., 1.,  4063.013, 2524.6,  472.907,  651.378,  2846.2,  34.4  ,  186.6,  5.18,  3.7, 200.208,  3.5 ,  1.67),
           ( 37, 1968., 2.,  4131.998, 2563.3,  492.026,  646.145,  2893.5,  34.9  ,  190.5,  5.5 ,  3.5, 200.706,  5.77, -0.28),
           ( 38, 1968., 3.,  4160.267, 2611.5,  476.053,  640.615,  2899.3,  35.3  ,  194. ,  5.21,  3.5, 201.29 ,  4.56,  0.65),
           ( 39, 1968., 4.,  4178.293, 2623.5,  480.998,  636.729,  2918.4,  35.7  ,  198.7,  5.85,  3.4, 201.76 ,  4.51,  1.34),
           ( 40, 1969., 1.,  4244.1  , 2652.9,  512.686,  633.224,  2923.4,  36.3  ,  200.7,  6.08,  3.4, 202.161,  6.67, -0.58),
           ( 41, 1969., 2.,  4256.46 , 2669.8,  508.601,  623.16 ,  2952.9,  36.8  ,  201.7,  6.49,  3.4, 202.677,  5.47,  1.02),
           ( 42, 1969., 3.,  4283.378, 2682.7,  520.36 ,  623.613,  3012.9,  37.3  ,  202.9,  7.02,  3.6, 203.302,  5.4 ,  1.63),
           ( 43, 1969., 4.,  4263.261, 2704.1,  492.334,  606.9  ,  3034.9,  37.9  ,  206.2,  7.64,  3.6, 203.849,  6.38,  1.26),
           ( 44, 1970., 1.,  4256.573, 2720.7,  476.925,  594.888,  3050.1,  38.5  ,  206.7,  6.76,  4.2, 204.401,  6.28,  0.47),
           ( 45, 1970., 2.,  4264.289, 2733.2,  478.419,  576.257,  3103.5,  38.9  ,  208. ,  6.66,  4.8, 205.052,  4.13,  2.52),
           ( 46, 1970., 3.,  4302.259, 2757.1,  486.594,  567.743,  3145.4,  39.4  ,  212.9,  6.15,  5.2, 205.788,  5.11,  1.04),
           ( 47, 1970., 4.,  4256.637, 2749.6,  458.406,  564.666,  3135.1,  39.9  ,  215.5,  4.86,  5.8, 206.466,  5.04, -0.18),
           ( 48, 1971., 1.,  4374.016, 2802.2,  517.935,  542.709,  3197.3,  40.1  ,  220. ,  3.65,  5.9, 207.065,  2.  ,  1.65),
           ( 49, 1971., 2.,  4398.829, 2827.9,  533.986,  534.905,  3245.3,  40.6  ,  224.9,  4.76,  5.9, 207.661,  4.96, -0.19),
           ( 50, 1971., 3.,  4433.943, 2850.4,  541.01 ,  532.646,  3259.7,  40.9  ,  227.2,  4.7 ,  6. , 208.345,  2.94,  1.75),
           ( 51, 1971., 4.,  4446.264, 2897.8,  524.085,  516.14 ,  3294.2,  41.2  ,  230.1,  3.87,  6. , 208.917,  2.92,  0.95),
           ( 52, 1972., 1.,  4525.769, 2936.5,  561.147,  518.192,  3314.9,  41.5  ,  235.6,  3.55,  5.8, 209.386,  2.9 ,  0.64),
           ( 53, 1972., 2.,  4633.101, 2992.6,  595.495,  526.473,  3346.1,  41.8  ,  238.8,  3.86,  5.7, 209.896,  2.88,  0.98),
           ( 54, 1972., 3.,  4677.503, 3038.8,  603.97 ,  498.116,  3414.6,  42.2  ,  245. ,  4.47,  5.6, 210.479,  3.81,  0.66),
           ( 55, 1972., 4.,  4754.546, 3110.1,  607.104,  496.54 ,  3550.5,  42.7  ,  251.5,  5.09,  5.3, 210.985,  4.71,  0.38),
           ( 56, 1973., 1.,  4876.166, 3167. ,  645.654,  504.838,  3590.7,  43.7  ,  252.7,  5.98,  5. , 211.42 ,  9.26, -3.28),
           ( 57, 1973., 2.,  4932.571, 3165.4,  675.837,  497.033,  3626.2,  44.2  ,  257.5,  7.19,  4.9, 211.909,  4.55,  2.64),
           ( 58, 1973., 3.,  4906.252, 3176.7,  649.412,  475.897,  3644.4,  45.6  ,  259. ,  8.06,  4.8, 212.475, 12.47, -4.41),
           ( 59, 1973., 4.,  4953.05 , 3167.4,  674.253,  476.174,  3688.9,  46.8  ,  263.8,  7.68,  4.8, 212.932, 10.39, -2.71),
           ( 60, 1974., 1.,  4909.617, 3139.7,  631.23 ,  491.043,  3632.3,  48.1  ,  267.2,  7.8 ,  5.1, 213.361, 10.96, -3.16),
           ( 61, 1974., 2.,  4922.188, 3150.6,  628.102,  490.177,  3601.1,  49.3  ,  269.3,  7.89,  5.2, 213.854,  9.86, -1.96),
           ( 62, 1974., 3.,  4873.52 , 3163.6,  592.672,  492.586,  3612.4,  51.   ,  272.3,  8.16,  5.6, 214.451, 13.56, -5.4 ),
           ( 63, 1974., 4.,  4854.34 , 3117.3,  598.306,  496.176,  3596. ,  52.3  ,  273.9,  6.96,  6.6, 214.931, 10.07, -3.11),
           ( 64, 1975., 1.,  4795.295, 3143.4,  493.212,  490.603,  3581.9,  53.   ,  276.2,  5.53,  8.2, 215.353,  5.32,  0.22),
           ( 65, 1975., 2.,  4831.942, 3195.8,  476.085,  486.679,  3749.3,  54.   ,  283.7,  5.57,  8.9, 215.973,  7.48, -1.91),
           ( 66, 1975., 3.,  4913.328, 3241.4,  516.402,  498.836,  3698.6,  54.9  ,  285.4,  6.27,  8.5, 216.587,  6.61, -0.34),
           ( 67, 1975., 4.,  4977.511, 3275.7,  530.596,  500.141,  3736. ,  55.8  ,  288.4,  5.26,  8.3, 217.095,  6.5 , -1.24),
           ( 68, 1976., 1.,  5090.663, 3341.2,  585.541,  495.568,  3791. ,  56.1  ,  294.7,  4.91,  7.7, 217.528,  2.14,  2.77),
           ( 69, 1976., 2.,  5128.947, 3371.8,  610.513,  494.532,  3822.2,  57.   ,  297.2,  5.28,  7.6, 218.035,  6.37, -1.09),
           ( 70, 1976., 3.,  5154.072, 3407.5,  611.646,  493.141,  3856.7,  57.9  ,  302. ,  5.05,  7.7, 218.644,  6.27, -1.22),
           ( 71, 1976., 4.,  5191.499, 3451.8,  615.898,  494.415,  3884.4,  58.7  ,  308.3,  4.57,  7.8, 219.179,  5.49, -0.92),
           ( 72, 1977., 1.,  5251.762, 3491.3,  646.198,  498.509,  3887.5,  60.   ,  316. ,  4.6 ,  7.5, 219.684,  8.76, -4.16),
           ( 73, 1977., 2.,  5356.131, 3510.6,  696.141,  506.695,  3931.8,  60.8  ,  320.2,  5.06,  7.1, 220.239,  5.3 , -0.24),
           ( 74, 1977., 3.,  5451.921, 3544.1,  734.078,  509.605,  3990.8,  61.6  ,  326.4,  5.82,  6.9, 220.904,  5.23,  0.59),
           ( 75, 1977., 4.,  5450.793, 3597.5,  713.356,  504.584,  4071.2,  62.7  ,  334.4,  6.2 ,  6.6, 221.477,  7.08, -0.88),
           ( 76, 1978., 1.,  5469.405, 3618.5,  727.504,  506.314,  4096.4,  63.9  ,  339.9,  6.34,  6.3, 221.991,  7.58, -1.24),
           ( 77, 1978., 2.,  5684.569, 3695.9,  777.454,  518.366,  4143.4,  65.5  ,  347.6,  6.72,  6. , 222.585,  9.89, -3.18),
           ( 78, 1978., 3.,  5740.3  , 3711.4,  801.452,  520.199,  4177.1,  67.1  ,  353.3,  7.64,  6. , 223.271,  9.65, -2.01),
           ( 79, 1978., 4.,  5816.222, 3741.3,  819.689,  524.782,  4209.8,  68.5  ,  358.6,  9.02,  5.9, 223.865,  8.26,  0.76),
           ( 80, 1979., 1.,  5825.949, 3760.2,  819.556,  525.524,  4255.9,  70.6  ,  368. ,  9.42,  5.9, 224.438, 12.08, -2.66),
           ( 81, 1979., 2.,  5831.418, 3758. ,  817.66 ,  532.04 ,  4226.1,  73.   ,  377.2,  9.3 ,  5.7, 225.055, 13.37, -4.07),
           ( 82, 1979., 3.,  5873.335, 3794.9,  801.742,  531.232,  4250.3,  75.2  ,  380.8, 10.49,  5.9, 225.801, 11.88, -1.38),
           ( 83, 1979., 4.,  5889.495, 3805. ,  786.817,  531.126,  4284.3,  78.   ,  385.8, 11.94,  5.9, 226.451, 14.62, -2.68),
           ( 84, 1980., 1.,  5908.467, 3798.4,  781.114,  548.115,  4296.2,  80.9  ,  383.8, 13.75,  6.3, 227.061, 14.6 , -0.85),
           ( 85, 1980., 2.,  5787.373, 3712.2,  710.64 ,  561.895,  4236.1,  82.6  ,  394. ,  7.9 ,  7.3, 227.726,  8.32, -0.42),
           ( 86, 1980., 3.,  5776.617, 3752. ,  656.477,  554.292,  4279.7,  84.7  ,  409. , 10.34,  7.7, 228.417, 10.04,  0.3 ),
           ( 87, 1980., 4.,  5883.46 , 3802. ,  723.22 ,  556.13 ,  4368.1,  87.2  ,  411.3, 14.75,  7.4, 228.937, 11.64,  3.11),
           ( 88, 1981., 1.,  6005.717, 3822.8,  795.091,  567.618,  4358.1,  89.1  ,  427.4, 13.95,  7.4, 229.403,  8.62,  5.32),
           ( 89, 1981., 2.,  5957.795, 3822.8,  757.24 ,  584.54 ,  4358.6,  91.5  ,  426.9, 15.33,  7.4, 229.966, 10.63,  4.69),
           ( 90, 1981., 3.,  6030.184, 3838.3,  804.242,  583.89 ,  4455.4,  93.4  ,  428.4, 14.58,  7.4, 230.641,  8.22,  6.36),
           ( 91, 1981., 4.,  5955.062, 3809.3,  773.053,  590.125,  4464.4,  94.4  ,  442.7, 11.33,  8.2, 231.157,  4.26,  7.07),
           ( 92, 1982., 1.,  5857.333, 3833.9,  692.514,  591.043,  4469.6,  95.   ,  447.1, 12.95,  8.8, 231.645,  2.53, 10.42),
           ( 93, 1982., 2.,  5889.074, 3847.7,  691.9  ,  596.403,  4500.8,  97.5  ,  448. , 11.97,  9.4, 232.188, 10.39,  1.58),
           ( 94, 1982., 3.,  5866.37 , 3877.2,  683.825,  605.37 ,  4520.6,  98.1  ,  464.5,  8.1 ,  9.9, 232.816,  2.45,  5.65),
           ( 95, 1982., 4.,  5871.001, 3947.9,  622.93 ,  623.307,  4536.4,  97.9  ,  477.2,  7.96, 10.7, 233.322, -0.82,  8.77),
           ( 96, 1983., 1.,  5944.02 , 3986.6,  645.11 ,  630.873,  4572.2,  98.8  ,  493.2,  8.22, 10.4, 233.781,  3.66,  4.56),
           ( 97, 1983., 2.,  6077.619, 4065.7,  707.372,  644.322,  4605.5,  99.8  ,  507.8,  8.69, 10.1, 234.307,  4.03,  4.66),
           ( 98, 1983., 3.,  6197.468, 4137.6,  754.937,  662.412,  4674.7, 100.8  ,  517.2,  8.99,  9.4, 234.907,  3.99,  5.01),
           ( 99, 1983., 4.,  6325.574, 4203.2,  834.427,  639.197,  4771.1, 102.1  ,  525.1,  8.89,  8.5, 235.385,  5.13,  3.76),
           (100, 1984., 1.,  6448.264, 4239.2,  921.763,  644.635,  4875.4, 103.3  ,  535. ,  9.43,  7.9, 235.839,  4.67,  4.76),
           (101, 1984., 2.,  6559.594, 4299.9,  952.841,  664.839,  4959.4, 104.1  ,  540.9,  9.94,  7.5, 236.348,  3.09,  6.85),
           (102, 1984., 3.,  6623.343, 4333. ,  974.989,  662.294,  5036.6, 105.1  ,  543.7, 10.19,  7.4, 236.976,  3.82,  6.37),
           (103, 1984., 4.,  6677.264, 4390.1,  958.993,  684.282,  5084.5, 105.7  ,  557. ,  8.14,  7.3, 237.468,  2.28,  5.87),
           (104, 1985., 1.,  6740.275, 4464.6,  927.375,  691.613,  5072. , 107.   ,  570.4,  8.25,  7.3, 237.9  ,  4.89,  3.36),
           (105, 1985., 2.,  6797.344, 4505.2,  943.383,  708.524,  5172.7, 107.7  ,  589.1,  7.17,  7.3, 238.466,  2.61,  4.56),
           (106, 1985., 3.,  6903.523, 4590.8,  932.959,  732.305,  5140.7, 108.5  ,  607.8,  7.13,  7.2, 239.113,  2.96,  4.17),
           (107, 1985., 4.,  6955.918, 4600.9,  969.434,  732.026,  5193.9, 109.9  ,  621.4,  7.14,  7. , 239.638,  5.13,  2.01),
           (108, 1986., 1.,  7022.757, 4639.3,  967.442,  728.125,  5255.8, 108.7  ,  641. ,  6.56,  7. , 240.094, -4.39, 10.95),
           (109, 1986., 2.,  7050.969, 4688.7,  945.972,  751.334,  5315.5, 109.5  ,  670.3,  6.06,  7.2, 240.651,  2.93,  3.13),
           (110, 1986., 3.,  7118.95 , 4770.7,  916.315,  779.77 ,  5343.3, 110.2  ,  694.9,  5.31,  7. , 241.274,  2.55,  2.76),
           (111, 1986., 4.,  7153.359, 4799.4,  917.736,  767.671,  5346.5, 111.4  ,  730.2,  5.44,  6.8, 241.784,  4.33,  1.1 ),
           (112, 1987., 1.,  7193.019, 4792.1,  945.776,  772.247,  5379.4, 112.7  ,  743.9,  5.61,  6.6, 242.252,  4.64,  0.97),
           (113, 1987., 2.,  7269.51 , 4856.3,  947.1  ,  782.962,  5321. , 113.8  ,  743. ,  5.67,  6.3, 242.804,  3.89,  1.79),
           (114, 1987., 3.,  7332.558, 4910.4,  948.055,  783.804,  5416.2, 115.   ,  756.2,  6.19,  6. , 243.446,  4.2 ,  1.99),
           (115, 1987., 4.,  7458.022, 4922.2, 1021.98 ,  795.467,  5493.1, 116.   ,  756.2,  5.76,  5.9, 243.981,  3.46,  2.29),
           (116, 1988., 1.,  7496.6  , 5004.4,  964.398,  773.851,  5562.1, 117.2  ,  768.1,  5.76,  5.7, 244.445,  4.12,  1.64),
           (117, 1988., 2.,  7592.881, 5040.8,  987.858,  765.98 ,  5614.3, 118.5  ,  781.4,  6.48,  5.5, 245.021,  4.41,  2.07),
           (118, 1988., 3.,  7632.082, 5080.6,  994.204,  760.245,  5657.5, 119.9  ,  783.3,  7.22,  5.5, 245.693,  4.7 ,  2.52),
           (119, 1988., 4.,  7733.991, 5140.4, 1007.371,  783.065,  5708.5, 121.2  ,  785.7,  8.03,  5.3, 246.224,  4.31,  3.72),
           (120, 1989., 1.,  7806.603, 5159.3, 1045.975,  767.024,  5773.4, 123.1  ,  779.2,  8.67,  5.2, 246.721,  6.22,  2.44),
           (121, 1989., 2.,  7865.016, 5182.4, 1033.753,  784.275,  5749.8, 124.5  ,  777.8,  8.15,  5.2, 247.342,  4.52,  3.63),
           (122, 1989., 3.,  7927.393, 5236.1, 1021.604,  791.819,  5787. , 125.4  ,  786.6,  7.76,  5.3, 248.067,  2.88,  4.88),
           (123, 1989., 4.,  7944.697, 5261.7, 1011.119,  787.844,  5831.3, 127.5  ,  795.4,  7.65,  5.4, 248.659,  6.64,  1.01),
           (124, 1990., 1.,  8027.693, 5303.3, 1021.07 ,  799.681,  5875.1, 128.9  ,  806.2,  7.8 ,  5.3, 249.306,  4.37,  3.44),
           (125, 1990., 2.,  8059.598, 5320.8, 1021.36 ,  800.639,  5913.9, 130.5  ,  810.1,  7.7 ,  5.3, 250.132,  4.93,  2.76),
           (126, 1990., 3.,  8059.476, 5341. ,  997.319,  793.513,  5918.1, 133.4  ,  819.8,  7.33,  5.7, 251.057,  8.79, -1.46),
           (127, 1990., 4.,  7988.864, 5299.5,  934.248,  800.525,  5878.2, 134.7  ,  827.2,  6.67,  6.1, 251.889,  3.88,  2.79),
           (128, 1991., 1.,  7950.164, 5284.4,  896.21 ,  806.775,  5896.3, 135.1  ,  843.2,  5.83,  6.6, 252.643,  1.19,  4.65),
           (129, 1991., 2.,  8003.822, 5324.7,  891.704,  809.081,  5941.1, 136.2  ,  861.5,  5.54,  6.8, 253.493,  3.24,  2.29),
           (130, 1991., 3.,  8037.538, 5345. ,  913.904,  793.987,  5953.6, 137.2  ,  878. ,  5.18,  6.9, 254.435,  2.93,  2.25),
           (131, 1991., 4.,  8069.046, 5342.6,  948.891,  778.378,  5992.4, 138.3  ,  910.4,  4.14,  7.1, 255.214,  3.19,  0.95),
           (132, 1992., 1.,  8157.616, 5434.5,  927.796,  778.568,  6082.9, 139.4  ,  943.8,  3.88,  7.4, 255.992,  3.17,  0.71),
           (133, 1992., 2.,  8244.294, 5466.7,  988.912,  777.762,  6129.5, 140.5  ,  963.2,  3.5 ,  7.6, 256.894,  3.14,  0.36),
           (134, 1992., 3.,  8329.361, 5527.1,  999.135,  786.639,  6160.6, 141.7  , 1003.8,  2.97,  7.6, 257.861,  3.4 , -0.44),
           (135, 1992., 4.,  8417.016, 5594.6, 1030.758,  787.064,  6248.2, 142.8  , 1030.4,  3.12,  7.4, 258.679,  3.09,  0.02),
           (136, 1993., 1.,  8432.485, 5617.2, 1054.979,  762.901,  6156.5, 143.8  , 1047.6,  2.92,  7.2, 259.414,  2.79,  0.13),
           (137, 1993., 2.,  8486.435, 5671.1, 1063.263,  752.158,  6252.3, 144.5  , 1084.5,  3.02,  7.1, 260.255,  1.94,  1.08),
           (138, 1993., 3.,  8531.108, 5732.7, 1062.514,  744.227,  6265.7, 145.6  , 1113. ,  3.  ,  6.8, 261.163,  3.03, -0.04),
           (139, 1993., 4.,  8643.769, 5783.7, 1118.583,  748.102,  6358.1, 146.3  , 1131.6,  3.05,  6.6, 261.919,  1.92,  1.13),
           (140, 1994., 1.,  8727.919, 5848.1, 1166.845,  721.288,  6332.6, 147.2  , 1141.1,  3.48,  6.6, 262.631,  2.45,  1.02),
           (141, 1994., 2.,  8847.303, 5891.5, 1234.855,  717.197,  6440.6, 148.4  , 1150.5,  4.2 ,  6.2, 263.436,  3.25,  0.96),
           (142, 1994., 3.,  8904.289, 5938.7, 1212.655,  736.89 ,  6487.9, 149.4  , 1150.1,  4.68,  6. , 264.301,  2.69,  2.  ),
           (143, 1994., 4.,  9003.18 , 5997.3, 1269.19 ,  716.702,  6574. , 150.5  , 1151.4,  5.53,  5.6, 265.044,  2.93,  2.6 ),
           (144, 1995., 1.,  9025.267, 6004.3, 1282.09 ,  715.326,  6616.6, 151.8  , 1149.3,  5.72,  5.5, 265.755,  3.44,  2.28),
           (145, 1995., 2.,  9044.668, 6053.5, 1247.61 ,  712.492,  6617.2, 152.6  , 1145.4,  5.52,  5.7, 266.557,  2.1 ,  3.42),
           (146, 1995., 3.,  9120.684, 6107.6, 1235.601,  707.649,  6666.8, 153.5  , 1137.3,  5.32,  5.7, 267.456,  2.35,  2.97),
           (147, 1995., 4.,  9184.275, 6150.6, 1270.392,  681.081,  6706.2, 154.7  , 1123.5,  5.17,  5.6, 268.151,  3.11,  2.05),
           (148, 1996., 1.,  9247.188, 6206.9, 1287.128,  695.265,  6777.7, 156.1  , 1124.8,  4.91,  5.5, 268.853,  3.6 ,  1.31),
           (149, 1996., 2.,  9407.052, 6277.1, 1353.795,  705.172,  6850.6, 157.   , 1112.4,  5.09,  5.5, 269.667,  2.3 ,  2.79),
           (150, 1996., 3.,  9488.879, 6314.6, 1422.059,  692.741,  6908.9, 158.2  , 1086.1,  5.04,  5.3, 270.581,  3.05,  2.  ),
           (151, 1996., 4.,  9592.458, 6366.1, 1418.193,  690.744,  6946.8, 159.4  , 1081.5,  4.99,  5.3, 271.36 ,  3.02,  1.97),
           (152, 1997., 1.,  9666.235, 6430.2, 1451.304,  681.445,  7008.9, 159.9  , 1063.8,  5.1 ,  5.2, 272.083,  1.25,  3.85),

In [102]:
data = DataFrame(data.to_records(),
                 columns=pd.Index(['realgdp', 'infl', 'unemp'], name='item'),
                 index=periods.to_timestamp('D', 'end'))
data        # 분기를 조정 가능함.

item          realgdp  infl  unemp
date
1959-03-31   2710.349  0.00    5.8
1959-06-30   2778.801  2.34    5.1
1959-09-30   2775.488  2.74    5.3
1959-12-31   2785.204  0.27    5.6
1960-03-31   2847.699  2.31    5.2
1960-06-30   2834.390  0.14    5.2
1960-09-30   2839.022  2.70    5.6
1960-12-31   2802.616  1.21    6.3
1961-03-31   2819.264 -0.40    6.8
1961-06-30   2872.005  1.47    7.0
1961-09-30   2918.419  0.80    6.8
1961-12-31   2977.830  0.80    6.2
1962-03-31   3031.241  2.26    5.6
1962-06-30   3064.709  0.13    5.5
1962-09-30   3093.047  2.11    5.6
1962-12-31   3100.563  0.79    5.5
1963-03-31   3141.087  0.53    5.8
1963-06-30   3180.447  2.75    5.7
1963-09-30   3240.332  0.78    5.5
1963-12-31   3264.967  2.46    5.6
1964-03-31   3338.246  0.13    5.5
1964-06-30   3376.587  0.90    5.2
1964-09-30   3422.469  1.29    5.0
1964-12-31   3431.957  2.05    5.0
1965-03-31   3516.251  1.28    4.9
1965-06-30   3563.960  2.54    4.7
1965-09-30   3636.285  0.89    4.4
1965-12-31   3724.014  2.90    4.1
1966-03-31   3815.423  4.99    3.9
1966-06-30   3828.124  2.10    3.8
1966-09-30   3853.301  4.90    3.8
1966-12-31   3884.520  0.61    3.7
1967-03-31   3918.740  2.42    3.8
1967-06-30   3919.556  3.61    3.8
1967-09-30   3950.826  3.58    3.8
1967-12-31   3980.970  4.72    3.9
1968-03-31   4063.013  3.50    3.7
1968-06-30   4131.998  5.77    3.5
1968-09-30   4160.267  4.56    3.5
1968-12-31   4178.293  4.51    3.4
1969-03-31   4244.100  6.67    3.4
1969-06-30   4256.460  5.47    3.4
1969-09-30   4283.378  5.40    3.6
1969-12-31   4263.261  6.38    3.6
1970-03-31   4256.573  6.28    4.2
1970-06-30   4264.289  4.13    4.8
1970-09-30   4302.259  5.11    5.2
1970-12-31   4256.637  5.04    5.8
1971-03-31   4374.016  2.00    5.9
1971-06-30   4398.829  4.96    5.9
...               ...   ...    ...
1997-06-30   9809.551  1.25    5.0
1997-09-30   9932.672  2.73    4.9
1997-12-31  10008.874  1.24    4.7
1998-03-31  10103.425  0.49    4.6
1998-06-30  10194.277  2.46    4.4
1998-09-30  10328.787  1.71    4.5
1998-12-31  10507.575  1.95    4.4
1999-03-31  10601.179  2.90    4.3
1999-06-30  10684.049  1.92    4.3
1999-09-30  10819.914  3.35    4.2
1999-12-31  11014.254  2.85    4.1
2000-03-31  11043.044  3.76    4.0
2000-06-30  11258.454  4.19    3.9
2000-09-30  11267.867  2.77    4.0
2000-12-31  11334.544  3.89    3.9
2001-03-31  11297.171  1.82    4.2
2001-06-30  11371.251  2.26    4.4
2001-09-30  11340.075  0.45    4.8
2001-12-31  11380.128  0.23    5.5
2002-03-31  11477.868  3.59    5.7
2002-06-30  11538.770  1.56    5.8
2002-09-30  11596.430  2.66    5.7
2002-12-31  11598.824  3.08    5.8
2003-03-31  11645.819  1.31    5.9
2003-06-30  11738.706  1.09    6.2
2003-09-30  11935.461  2.60    6.1
2003-12-31  12042.817  3.02    5.8
2004-03-31  12127.623  2.35    5.7
2004-06-30  12213.818  3.61    5.6
2004-09-30  12303.533  3.58    5.4
2004-12-31  12410.282  2.09    5.4
2005-03-31  12534.113  4.15    5.3
2005-06-30  12587.535  1.85    5.1
2005-09-30  12683.153  9.14    5.0
2005-12-31  12748.699  0.40    4.9
2006-03-31  12915.938  2.60    4.7
2006-06-30  12962.462  3.97    4.7
2006-09-30  12965.916 -1.58    4.7
2006-12-31  13060.679  3.30    4.4
2007-03-31  13099.901  4.58    4.5
2007-06-30  13203.977  2.75    4.5
2007-09-30  13321.109  3.45    4.7
2007-12-31  13391.249  6.38    4.8
2008-03-31  13366.865  2.82    4.9
2008-06-30  13415.266  8.53    5.4
2008-09-30  13324.600 -3.16    6.0
2008-12-31  13141.920 -8.79    6.9
2009-03-31  12925.410  0.94    8.1
2009-06-30  12901.504  3.37    9.2
2009-09-30  12990.341  3.56    9.6

[203 rows x 3 columns]

In [ ]:
data.stack().reset_index().rename(columns={0: 'value'})

In [ ]:
ldata = data.stack().reset_index().rename(columns={0: 'value'})
wdata = ldata.pivot('date', 'item', 'value')

In [ ]:
ldata[:10]
wdata

In [ ]:
pivoted = ldata.pivot('date', 'item', 'value')
pivoted.head()

In [ ]:
ldata['value2'] = np.random.randn(len(ldata))
ldata[:10]

In [ ]:
pivoted = ldata.pivot('date', 'item')
pivoted[:5]

In [ ]:
pivoted['value'][:5]

In [ ]:
ldata.set_index(['date', 'item'])

In [ ]:
unstacked = ldata.set_index(['date', 'item']).unstack('item')
unstacked[:7]

## Data transformation

### Removing duplicates

In [ ]:
data = DataFrame({'k1': ['one'] * 3 + ['two'] * 4,
                  'k2': [1, 1, 2, 3, 3, 4, 4]})
data

In [ ]:
data.duplicated()

In [ ]:
data.drop_duplicates()

In [ ]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

In [ ]:
#data.drop_duplicates(['k1', 'k2'], take_last=True)
data.drop_duplicates(['k1', 'k2'], keep='last')

### Transforming data using a function or mapping

In [ ]:
data = DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami',
                           'corned beef', 'Bacon', 'pastrami', 'honey ham',
                           'nova lox'],
                  'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

In [ ]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [ ]:
str.lower(data['food'])

In [ ]:
%timeit data['food'].map(str.lower).map(meat_to_animal)

In [ ]:
data['animal'] = data['food'].map(str.lower).map(meat_to_animal)
data

In [ ]:
%timeit data['food'].map(lambda x: meat_to_animal[x.lower()])

### Replacing values

In [ ]:
data = Series([1., -999., 2., -999., -1000., 3.])
data

In [ ]:
data[data == -999] = np.nan

In [ ]:
data.replace(-999, np.nan)

In [ ]:
data.replace([-999, -1000], np.nan)

In [ ]:
data.replace([-999, -1000], [np.nan, 0])

In [ ]:
data.replace({-999: np.nan, -1000: 0})

### Renaming axis indexes

In [ ]:
data = DataFrame(np.arange(12).reshape((3, 4)),
                 index=['Ohio', 'Colorado', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

In [ ]:
data.index
data.index.map(str.upper)

In [ ]:
data.index = data.index.map(str.upper)
data

In [ ]:
data.rename(index=str.title, columns=str.upper)

In [ ]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

In [ ]:
data.rename(index={'OHIo': 'INDIANA', 'NEW YORK': 'NY'},
            columns={'three': 'peekaboo'})

In [ ]:
# Always returns a reference to a DataFrame
_ = data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

### Discretization and binning

In [ ]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [ ]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

In [ ]:
cats.codes
#cats.labels

In [ ]:
cats.categories
#cats.levels

In [ ]:
pd.value_counts(cats)

In [ ]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

In [ ]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

In [ ]:
pd.value_counts(pd.cut(ages, bins, labels=group_names))

In [ ]:
data = np.random.rand(20)
pd.value_counts(pd.cut(data, 4, precision=2))
data

In [ ]:
catal = pd.cut(data, 5)
data
catal

In [ ]:
pd.value_counts(catal)

In [ ]:
data = np.random.randn(1000) # Normally distributed
cats = pd.qcut(data, 4) # Cut into quartiles
cats

In [ ]:
pd.value_counts(cats)

In [ ]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])
pd.value_counts(pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]))

### Detecting and filtering outliers

In [ ]:
np.random.seed(12345)
data = DataFrame(np.random.randn(1000, 4))
data.head()
data.describe()

In [ ]:
col = data[3]
col[np.abs(col) > 3]

In [ ]:
np.abs(data) > 3
(np.abs(data) > 3).any(1)

In [ ]:
data[(np.abs(data) > 3).any(1)]

In [ ]:
np.abs(data) > 3

In [ ]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

In [ ]:
data.head(10)

### Permutation and random sampling

In [ ]:
df = DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(5)
sampler

In [ ]:
df

In [ ]:
df.take(sampler)

In [ ]:
df.take(np.random.permutation(len(df))[:3])

In [ ]:
bag = np.array([5, 7, -1, 6, 4])
sampler = np.random.randint(0, len(bag), size=10)

In [ ]:
sampler

In [ ]:
draws = bag.take(sampler)
draws

In [ ]:
bag[sampler]

## 로또 시뮬레이션

In [ ]:
def show_me_the_lotto(money=10000, lotto_price=1000):
    return Series(np.arange(money/lotto_price))\
                .map(lambda x: np.sort(np.random.permutation(45)[:6] + 1))

In [ ]:
show_me_the_lotto()

### Computing indicator / dummy variables

In [ ]:
df = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                'data1': range(6)})
df
pd.get_dummies(df['key'])

In [ ]:
df[['data1']]

In [ ]:
dummies = pd.get_dummies(df['key'], prefix='key')
dummies
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

In [ ]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('ch02/movielens/movies.dat', sep='::', header=None,
                        names=mnames)
movies[:10]

In [ ]:
genre_iter = (set(x.split('|')) for x in movies.genres)
genres = sorted(set.union(*genre_iter))
genres

In [ ]:
dummies = DataFrame(np.zeros((len(movies), len(genres))), columns=genres)
dummies

In [ ]:
gen1 = movies.genres[0]; gen1
gen1.split('|')

In [ ]:
for i, gen in enumerate(movies.genres):
    dummies.loc[i, gen.split('|')] = 1

In [ ]:
dummies

In [ ]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.loc[0]

In [ ]:
np.random.seed(12345)

In [ ]:
values = np.random.rand(10)
values

In [ ]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

## String manipulation

### String object methods

In [ ]:
val = 'a,b,  guido'
val.split(',')

In [ ]:
pieces = [x.strip() for x in val.split(',')]
pieces

In [ ]:
first, second, third = pieces
first + '::' + second + '::' + third

In [ ]:
'::'.join(pieces)

In [ ]:
'guido' in val

In [ ]:
val.index(',')

In [ ]:
val.find(':')

In [ ]:
val.index(':')

In [ ]:
val.count(',')

In [ ]:
val.replace(',', '::')

In [ ]:
val.replace(',', '')

### Regular expressions

In [ ]:
import re
text = "foo    bar\t baz  \tqux"
print(text)
text.split(' ')
re.split('\s+', text)
re.findall('\w+', text)

In [ ]:
regex = re.compile('\s+')
regex.split(text)

In [ ]:
regex.findall(text)

In [ ]:
text = """Dave dave@google.com
Iceman iceman@snu.ac.kr
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [ ]:
regex.findall(text)

In [ ]:
m = regex.search(text)
m
type(m)

In [ ]:
m.start()
m.end()
text[m.start():m.end()]

In [ ]:
print(regex.match(text))

In [ ]:
print(text)
print(regex.sub('REDACTED', text))

In [ ]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [ ]:
m = regex.match('wesm@bright.abc.net.com')
m.groups()
m.group(1)
m.group(0)

In [ ]:
regex.findall(text)

In [ ]:
print(text)

In [ ]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

In [ ]:
regex = re.compile(r"""
    (?P<username>[A-Z0-9._%+-]+)
    @
    (?P<domain>[A-Z0-9.-]+)
    \.
    (?P<suffix>[A-Z]{2,4})""", flags=re.IGNORECASE|re.VERBOSE)

In [ ]:
m = regex.match('wesm@bright.net')
m.groupdict()

In [ ]:
m_dict = m.groupdict()
m_dict['username']

### Vectorized string functions in pandas

In [ ]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = Series(data)
data

In [ ]:
data.isnull()
data[data.notnull()]

In [ ]:
data.str.contains('gmail')

In [ ]:
pattern

In [ ]:
regex.findall(data)

In [ ]:
data[data.notnull()].map(regex.findall)

In [ ]:
df = DataFrame(data)
df

In [ ]:
df[:-1].applymap(regex.findall)

In [ ]:
data.str.findall(pattern, flags=re.IGNORECASE)

In [ ]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

In [ ]:
matches.str.get(1)

In [ ]:
matches.str[0]

In [ ]:
data.str[:5]

## Example: USDA Food Database

{
  "id": 21441,
  "description": "KENTUCKY FRIED CHICKEN, Fried Chicken, EXTRA CRISPY,
Wing, meat and skin with breading",
  "tags": ["KFC"],
  "manufacturer": "Kentucky Fried Chicken",
  "group": "Fast Foods",
  "portions": [
    {
      "amount": 1,
      "unit": "wing, with skin",
      "grams": 68.0
    },

    ...
  ],
  "nutrients": [
    {
      "value": 20.8,
      "units": "g",
      "description": "Protein",
      "group": "Composition"
    },

    ...
  ]
}

In [ ]:
import json
db = json.load(open('ch07/foods-2011-10-03.json'))
len(db)
type(db)

In [ ]:
db[0]

In [ ]:
db[0].keys()

In [ ]:
len(db[0]['nutrients'])
db[0]['nutrients'][0]

In [ ]:
nutrients = DataFrame(db[0]['nutrients'])
nutrients[:7]

In [ ]:
info_keys = ['description', 'group', 'id', 'manufacturer']
info = DataFrame(db, columns=info_keys)

In [ ]:
info[:5]

In [ ]:
info

In [ ]:
pd.value_counts(info.group)[:10]

In [ ]:
nutrients = []

for rec in db:
    fnuts = DataFrame(rec['nutrients'])
    fnuts['id'] = rec['id']
    nutrients.append(fnuts)

nutrients = pd.concat(nutrients, ignore_index=True)

In [ ]:
nutrients

In [ ]:
nutrients.duplicated().sum()

In [ ]:
nutrients = nutrients.drop_duplicates()

In [ ]:
col_mapping = {'description' : 'food',
               'group'       : 'fgroup'}
info = info.rename(columns=col_mapping, copy=False)
info

In [ ]:
col_mapping = {'description' : 'nutrient',
               'group' : 'nutgroup'}
nutrients = nutrients.rename(columns=col_mapping, copy=False)
nutrients

In [ ]:
ndata = pd.merge(nutrients, info, on='id', how='outer')

In [ ]:
ndata

In [ ]:
len(ndata)
ndata.loc[30000]

In [ ]:
len(ndata[ndata.nutrient == 'Glycine'])

In [ ]:
result = ndata.groupby(['nutrient', 'fgroup'])['value'].quantile(0.5)
#result['Zinc, Zn'].order().plot(kind='barh')
result['Zinc, Zn'].sort_values().plot(kind='barh')

In [ ]:
by_nutrient = ndata.groupby(['nutgroup', 'nutrient'])

get_maximum = lambda x: x.xs(x.value.idxmax())
get_minimum = lambda x: x.xs(x.value.idxmin())

max_foods = by_nutrient.apply(get_maximum)[['value', 'food']]

# make the food a little smaller
max_foods.food = max_foods.food.str[:50]

In [ ]:
max_foods.loc['Amino Acids']['food']